import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-outline-modal',
  templateUrl: './outline-modal.component.html',
  styleUrls: ['./outline-modal.component.scss'],
})
export class OutlineModalComponent implements OnInit {
  generalOutlines: any[] = [];

  constructor() {}
  ngOnInit(): void {
    this.generalOutlines = [
      {
        generalOutline:
          'ΤΟΜΕΑΣ ΠΟΛΙΤΙΚΗΣ: ΚΑΤΑΡΤΙΣΗ & ΔΙΑΧΕΙΡΙΣΗ ΔΗΜΟΣΙΩΝ ΠΟΛΙΤΙΚΩΝ',
        mission:
          'Αναπτύσσει και εφαρμόζει τις δημόσιες πολιτικές της Διεύθυνσης της οποίας προΐσταται.',
        mainDuties: [
          'Μεριμνά για την ευθυγράμμιση των στρατηγικών σκοπών της Διεύθυνσης...',
          'Διασφαλίζει την ορθή συνεργασία μεταξύ των οργανικών μονάδων της Διεύθυνσης...',
          'Συντονίζει και αναθέτει εργασίες στους προϊσταμένους των οργανικών μονάδων...',
          'Αναλαμβάνει πρωτοβουλίες για τη διαχείριση κρίσεων...',
        ],
        capabillities: [
          'Διαθέτει ηγετική φυσιογνωμία',
          'Είναι αποτελεσματικός στην επικοινωνία',
          'Είναι ανοιχτός σε νέες προσεγγίσεις',
        ],
        knowledge: [
          'Δημόσιο Δίκαιο',
          'Πολιτική, Θεσμοί & Διακυβέρνηση',
          'Διοικητική Οργάνωση & Μεταρρυθμίσεις',
        ],
      },
      {
        generalOutline:
          'ΤΟΜΕΑΣ ΠΟΛΙΤΙΚΗΣ: ΚΑΤΑΡΤΙΣΗ & ΔΙΑΧΕΙΡΙΣΗ ΔΗΜΟΣΙΩΝ ΠΟΛΙΤΙΚΩΝ',
        mission:
          'Αναπτύσσει και εφαρμόζει τις δημόσιες πολιτικές της Διεύθυνσης της οποίας προΐσταται.',
        mainDuties: [
          'Μεριμνά για την ευθυγράμμιση των στρατηγικών σκοπών της Διεύθυνσης...',
          'Διασφαλίζει την ορθή συνεργασία μεταξύ των οργανικών μονάδων της Διεύθυνσης...',
          'Συντονίζει και αναθέτει εργασίες στους προϊσταμένους των οργανικών μονάδων...',
          'Αναλαμβάνει πρωτοβουλίες για τη διαχείριση κρίσεων...',
        ],
        capabilities: [
          'Διαθέτει ηγετική φυσιογνωμία',
          'Είναι αποτελεσματικός στην επικοινωνία',
          'Είναι ανοιχτός σε νέες προσεγγίσεις',
        ],
        knowledge: [
          'Δημόσιο Δίκαιο',
          'Πολιτική, Θεσμοί & Διακυβέρνηση',
          'Διοικητική Οργάνωση & Μεταρρυθμίσεις',
        ],
      },
    ];
  }
}
